import './App.css';
import { useState } from 'react'


function App() {
  const [clicked, setclicked] = useState(false)


  const toggle = (i) => {
    if(clicked === i) {
      return setclicked(false)
    }

    setclicked(i)
  }

    return (
        <div className='wrapper'>
          <div className='accordion'>
            {data.map((item, i) => {
              return (
                <div className='item'>
                <div className={clicked === i? 'title active' :'title'} onClick={() => toggle(i)}>
                  {item.question}
                  <img className = {clicked === i? 'arrow active' :'arrow'} src="https://www.svgrepo.com/show/16711/right-arrow.svg"></img>
                </div>
                <div className = {clicked === i? 'content show' :'content'}>{item.answer}</div>
              </div>
              )
            })}
          </div>
        </div>
    )
}

const data = [
  {
    question: 'Show pasta #1',
    answer: 'Додики, одумайтесь! Аниме это ДЕГРАДАЦИЯ ОБЩЕСТВА, БЛЕВОТИНА ГОВНИСТАЯ, ВЫСЕР БЕЗМОЗГЛЫХ УРОДОВ!! ПОУМНЕЙТЕ ВЫ НАКОНЕЦ! Во понимаете, что благодаря этой говнохери ВО ПЕРВЫХ, ДЕТИ ПЕРЕСТАЛИ РАЗВИВАТЬСЯ, ПЯЛЯТ В ЭТО ХУЕНИМЕ СУТКАМИ! И Я НЕ ПРОСТО ТАК ГОВОРЮ, ООООЧЕЕНЬ МНОГО ПРИМЕРОВ ТОМУ. ВО ВТОРЫХ, ТАМ ПОДДЕРЖИВАЕТСЯ ПИДОРАСИНА, ВСЁ БОЛЬШЕ ГЛУПЫХ МАЛОЛЕТОК КРИЧАТ "Я БИ" И ПРЕВРАЩАЮТ СЕБЯ В ОТБРОС ПОКОЛЕНИЯ ВТРЕТЬЯХ ПСИХОЛОГИЧЕСКИМИ МЕТОДАМИ ДАААВНООО ДОКАЗАНО, ЧТО ЭТО ВЫЗЫВАЕТ ЗАВИСИМОСТЬ И НЕПРИЯТИЕ НАСТОЯЩЕГО МИРА!'
  },
  {
    question: 'Show pasta #2',
    answer: 'Забанят буду кайфовать, ебать! 😎 Просто балдеть, ебать, 24 на 7! 😏 У меня денег столько 💰, ебать, что ты просто, 🤠ты даже себе не представляешь.🍑 Но тем не менее, я хочу сказать☺. 🙀Ребята, во-первых, я неприкасаемый.😎 Во-вторых, пацаны хых с треда...😏 вам это нахуй не надо,🙃 хых забейте короче, забейте. 😗 Я уважаю вас 🤓🤠😴'
  },
  {
    question: 'Show pasta #3',
    answer: 'Ты зачем хамишь, рыбёнок? В реале ты бы не вывез 100% так почему понтишь в сети? тут не страшно?'
  },
  {
    question: 'Show pasta #4',
    answer: 'Слушай сюда, я в 90-х пережил три покушения, воевал с Тамбовским ОПГ и крышевал рынки на Ростове. Так вот таких как ты я повидал в своей жизни много раз, про таких говорили, что "мама не хотела, отец не старался". После 90-х всех их отпетушили на зонах. Так что вникай в мое послание и меняй свое поведение'
  }
]

export default App;
